jadjer/esp32-nimble/src/Device.cpp
// Copyright 2024 Pavel Suprunov
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "sdkconfig.h"
#if defined(CONFIG_BT_NIMBLE_ENABLED)

#include "nimble/Device.hpp"
#include "nimble/Utils.hpp"

#include "esp_bt.h"
#include "esp_err.h"
#include "host/ble_hs.h"
#include "host/ble_hs_pvcy.h"
#include "host/util/util.h"
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "nvs_flash.h"
#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"

#include "nimble/Log.hpp"

static const char *LOG_TAG = "Device";

namespace nimble {

/**
 * Singletons for the Device.
 */
static bool initialized = false;

#if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
Scan *Device::m_pScan = nullptr;
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
Server *Device::m_pServer = nullptr;
#endif

uint32_t Device::m_passkey = 123456;
bool Device::m_synced = false;

#if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)
#if CONFIG_BT_NIMBLE_EXT_ADV
NimBLEExtAdvertising *Device::m_bleAdvertising = nullptr;
#else
Advertising *Device::m_bleAdvertising = nullptr;
#endif
#endif

gap_event_handler Device::m_customGapHandler = nullptr;

ble_gap_event_listener Device::m_listener;

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
std::list<Client *> Device::m_cList;
#endif

std::list<Address> Device::m_ignoreList;
std::vector<Address> Device::m_whiteList;

uint8_t Device::m_own_addr_type = BLE_OWN_ADDR_PUBLIC;

#ifdef CONFIG_BTDM_BLE_SCAN_DUPL
uint16_t Device::m_scanDuplicateSize = CONFIG_BTDM_SCAN_DUPL_CACHE_SIZE;
uint8_t Device::m_scanFilterMode = CONFIG_BTDM_SCAN_DUPL_TYPE;
#endif

/**
 * @brief Create a new instance of a server.
 * @return A new instance of the server.
 */
#if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
/* STATIC */ Server *Device::createServer() {
  if (Device::m_pServer == nullptr) {
    Device::m_pServer = new Server();
    ble_gatts_reset();
    ble_svc_gap_init();
    ble_svc_gatt_init();
  }

  return m_pServer;
}// createServer

/**
 * @brief Get the instance of the server.
 * @return A pointer to the server instance.
 */
/* STATIC */ Server *Device::getServer() {
  return m_pServer;
}// getServer
#endif// #if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)

#if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)
#if CONFIG_BT_NIMBLE_EXT_ADV
/**
 * @brief Get the instance of the advertising object.
 * @return A pointer to the advertising object.
 */
NimBLEExtAdvertising *Device::getAdvertising() {
  if (m_bleAdvertising == nullptr) {
    m_bleAdvertising = new NimBLEExtAdvertising();
  }
  return m_bleAdvertising;
}

/**
 * @brief Convenience function to begin advertising.
 * @param [in] inst_id The extended advertisement instance ID to start.
 * @param [in] duration How long to advertise for in milliseconds, 0 = forever (default).
 * @param [in] max_events Maximum number of advertisement events to send, 0 = no limit (default).
 * @return True if advertising started successfully.
 */
bool Device::startAdvertising(uint8_t inst_id,
                                    int duration,
                                    int max_events) {
  return getAdvertising()->start(inst_id, duration, max_events);
}// startAdvertising

/**
 * @brief Convenience function to stop advertising a data set.
 * @param [in] inst_id The extended advertisement instance ID to stop advertising.
 * @return True if advertising stopped successfully.
 */
bool Device::stopAdvertising(uint8_t inst_id) {
  return getAdvertising()->stop(inst_id);
}// stopAdvertising

#endif

#if !CONFIG_BT_NIMBLE_EXT_ADV
/**
 * @brief Get the instance of the advertising object.
 * @return A pointer to the advertising object.
 */
Advertising *Device::getAdvertising() {
  if (m_bleAdvertising == nullptr) {
    m_bleAdvertising = new Advertising();
  }
  return m_bleAdvertising;
}

/**
 * @brief Convenience function to begin advertising.
 * @param [in] duration The duration in milliseconds to advertise for, default = forever.
 * @return True if advertising started successfully.
 */
bool Device::startAdvertising(uint32_t duration) {
  return getAdvertising()->start(duration);
}// startAdvertising
#endif

/**
 * @brief Convenience function to stop all advertising.
 * @return True if advertising stopped successfully.
 */
bool Device::stopAdvertising() {
  return getAdvertising()->stop();
}// stopAdvertising
#endif// #if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)

/**
 * @brief Retrieve the Scan object that we use for scanning.
 * @return The scanning object reference.  This is a singleton object.  The caller should not
 * try and release/delete it.
 */
#if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
/* STATIC */
Scan *Device::getScan() {
  if (m_pScan == nullptr) {
    m_pScan = new Scan();
  }
  return m_pScan;
}// getScan
#endif// #if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)

/**
 * @brief Creates a new client object and maintains a list of all client objects
 * each client can connect to 1 peripheral device.
 * @param [in] peerAddress An optional peer address that is copied to the new client
 * object, allows for calling NimBLEClient::connect(bool) without a device or address parameter.
 * @return A reference to the new client object.
 */
#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
/* STATIC */
Client *Device::createClient(Address peerAddress) {
  if (m_cList.size() >= NIMBLE_MAX_CONNECTIONS) {
    NIMBLE_LOGW(LOG_TAG, "Number of clients exceeds Max connections. Cur=%d Max=%d",
                m_cList.size(), NIMBLE_MAX_CONNECTIONS);
  }

  Client *pClient = new Client(peerAddress);
  m_cList.push_back(pClient);

  return pClient;
}// createClient

/**
 * @brief Delete the client object and remove it from the list.\n
 * Checks if it is connected or trying to connect and disconnects/stops it first.
 * @param [in] pClient A pointer to the client object.
 */
/* STATIC */
bool Device::deleteClient(Client *pClient) {
  if (pClient == nullptr) {
    return false;
  }

  // Set the connection established flag to false to stop notifications
  // from accessing the attribute vectors while they are being deleted.
  pClient->m_connEstablished = false;
  int rc = 0;

  if (pClient->isConnected()) {
    rc = pClient->disconnect();
    if (rc != 0 && rc != BLE_HS_EALREADY && rc != BLE_HS_ENOTCONN) {
      return false;
    }

    while (pClient->isConnected()) {
      taskYIELD();
    }
    // Since we set the flag to false the app will not get a callback
    // in the disconnect event so we call it here for good measure.
    pClient->m_pClientCallbacks->onDisconnect(pClient, BLE_ERR_CONN_TERM_LOCAL);

