jadjer/esp32-nimble/src/Device.cpp
  } else if (pClient->m_pTaskData != nullptr) {
    rc = ble_gap_conn_cancel();
    if (rc != 0 && rc != BLE_HS_EALREADY) {
      return false;
    }
    while (pClient->m_pTaskData != nullptr) {
      taskYIELD();
    }
  }

  m_cList.remove(pClient);
  delete pClient;

  return true;
}// deleteClient

/**
 * @brief Get the list of created client objects.
 * @return A pointer to the list of clients.
 */
/* STATIC */
std::list<Client *> *Device::getClientList() {
  return &m_cList;
}// getClientList

/**
 * @brief Get the number of created client objects.
 * @return Number of client objects created.
 */
/* STATIC */
size_t Device::getClientListSize() {
  return m_cList.size();
}// getClientList

/**
 * @brief Get a reference to a client by connection ID.
 * @param [in] conn_id The client connection ID to search for.
 * @return A pointer to the client object with the spcified connection ID.
 */
/* STATIC */
Client *Device::getClientByID(uint16_t conn_id) {
  for (auto it = m_cList.cbegin(); it != m_cList.cend(); ++it) {
    if ((*it)->getConnId() == conn_id) {
      return (*it);
    }
  }
  assert(0);
  return nullptr;
}// getClientByID

/**
 * @brief Get a reference to a client by peer address.
 * @param [in] peer_addr The address of the peer to search for.
 * @return A pointer to the client object with the peer address.
 */
/* STATIC */
Client *Device::getClientByPeerAddress(const Address &peer_addr) {
  for (auto it = m_cList.cbegin(); it != m_cList.cend(); ++it) {
    if ((*it)->getPeerAddress().equals(peer_addr)) {
      return (*it);
    }
  }
  return nullptr;
}// getClientPeerAddress

/**
 * @brief Finds the first disconnected client in the list.
 * @return A pointer to the first client object that is not connected to a peer.
 */
/* STATIC */
Client *Device::getDisconnectedClient() {
  for (auto it = m_cList.cbegin(); it != m_cList.cend(); ++it) {
    if (!(*it)->isConnected()) {
      return (*it);
    }
  }
  return nullptr;
}// getDisconnectedClient

#endif// #if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)

#ifdef ESP_PLATFORM
/**
 * @brief Set the transmission power.
 * @param [in] powerLevel The power level to set, can be one of:
 * *   ESP_PWR_LVL_N12 = 0, Corresponding to -12dbm
 * *   ESP_PWR_LVL_N9  = 1, Corresponding to  -9dbm
 * *   ESP_PWR_LVL_N6  = 2, Corresponding to  -6dbm
 * *   ESP_PWR_LVL_N3  = 3, Corresponding to  -3dbm
 * *   ESP_PWR_LVL_N0  = 4, Corresponding to   0dbm
 * *   ESP_PWR_LVL_P3  = 5, Corresponding to  +3dbm
 * *   ESP_PWR_LVL_P6  = 6, Corresponding to  +6dbm
 * *   ESP_PWR_LVL_P9  = 7, Corresponding to  +9dbm
 * @param [in] powerType The BLE function to set the power level for, can be one of:
 * *   ESP_BLE_PWR_TYPE_CONN_HDL0  = 0,  For connection handle 0
 * *   ESP_BLE_PWR_TYPE_CONN_HDL1  = 1,  For connection handle 1
 * *   ESP_BLE_PWR_TYPE_CONN_HDL2  = 2,  For connection handle 2
 * *   ESP_BLE_PWR_TYPE_CONN_HDL3  = 3,  For connection handle 3
 * *   ESP_BLE_PWR_TYPE_CONN_HDL4  = 4,  For connection handle 4
 * *   ESP_BLE_PWR_TYPE_CONN_HDL5  = 5,  For connection handle 5
 * *   ESP_BLE_PWR_TYPE_CONN_HDL6  = 6,  For connection handle 6
 * *   ESP_BLE_PWR_TYPE_CONN_HDL7  = 7,  For connection handle 7
 * *   ESP_BLE_PWR_TYPE_CONN_HDL8  = 8,  For connection handle 8
 * *   ESP_BLE_PWR_TYPE_ADV        = 9,  For advertising
 * *   ESP_BLE_PWR_TYPE_SCAN       = 10, For scan
 * *   ESP_BLE_PWR_TYPE_DEFAULT    = 11, For default, if not set other, it will use default value
 */
/* STATIC */
void Device::setPower(esp_power_level_t powerLevel, esp_ble_power_type_t powerType) {
  NIMBLE_LOGD(LOG_TAG, ">> setPower: %d (type: %d)", powerLevel, powerType);

  esp_err_t errRc = esp_ble_tx_power_set(powerType, powerLevel);
  if (errRc != ESP_OK) {
    NIMBLE_LOGE(LOG_TAG, "esp_ble_tx_power_set: rc=%d", errRc);
  }

  NIMBLE_LOGD(LOG_TAG, "<< setPower");
}// setPower

/**
 * @brief Get the transmission power.
 * @param [in] powerType The power level to set, can be one of:
 * *   ESP_BLE_PWR_TYPE_CONN_HDL0  = 0,  For connection handle 0
 * *   ESP_BLE_PWR_TYPE_CONN_HDL1  = 1,  For connection handle 1
 * *   ESP_BLE_PWR_TYPE_CONN_HDL2  = 2,  For connection handle 2
 * *   ESP_BLE_PWR_TYPE_CONN_HDL3  = 3,  For connection handle 3
 * *   ESP_BLE_PWR_TYPE_CONN_HDL4  = 4,  For connection handle 4
 * *   ESP_BLE_PWR_TYPE_CONN_HDL5  = 5,  For connection handle 5
 * *   ESP_BLE_PWR_TYPE_CONN_HDL6  = 6,  For connection handle 6
 * *   ESP_BLE_PWR_TYPE_CONN_HDL7  = 7,  For connection handle 7
 * *   ESP_BLE_PWR_TYPE_CONN_HDL8  = 8,  For connection handle 8
 * *   ESP_BLE_PWR_TYPE_ADV        = 9,  For advertising
 * *   ESP_BLE_PWR_TYPE_SCAN       = 10, For scan
 * *   ESP_BLE_PWR_TYPE_DEFAULT    = 11, For default, if not set other, it will use default value
 * @return the power level currently used by the type specified.
 */
/* STATIC */
int Device::getPower(esp_ble_power_type_t powerType) {
  switch (esp_ble_tx_power_get(powerType)) {
  case ESP_PWR_LVL_N12:
    return -12;
  case ESP_PWR_LVL_N9:
    return -9;
  case ESP_PWR_LVL_N6:
    return -6;
  case ESP_PWR_LVL_N3:
    return -3;
  case ESP_PWR_LVL_N0:
    return 0;
  case ESP_PWR_LVL_P3:
    return 3;
  case ESP_PWR_LVL_P6:
    return 6;
  case ESP_PWR_LVL_P9:
    return 9;
  default:
    return BLE_HS_ADV_TX_PWR_LVL_AUTO;
  }
}// getPower

#else

void Device::setPower(int dbm) {
  ble_phy_txpwr_set(dbm);
}

int Device::getPower() {
  return ble_phy_txpwr_get();
}
#endif

/**
 * @brief Get our device address.
 * @return A NimBLEAddress object of our public address if we have one,
 * if not then our current random address.
 */
/* STATIC*/
Address Device::getAddress() {
  ble_addr_t addr = {BLE_ADDR_PUBLIC, 0};

  if (BLE_HS_ENOADDR == ble_hs_id_copy_addr(BLE_ADDR_PUBLIC, addr.val, NULL)) {
    NIMBLE_LOGD(LOG_TAG, "Public address not found, checking random");
    addr.type = BLE_ADDR_RANDOM;
    ble_hs_id_copy_addr(BLE_ADDR_RANDOM, addr.val, NULL);
  }

  return Address(addr);
}// getAddress

/**
 * @brief Return a string representation of the address of this device.
 * @return A string representation of this device address.
 */
/* STATIC */
std::string Device::toString() {
  return getAddress().toString();
}// toString

/**
 * @brief Setup local mtu that will be used to negotiate mtu during request from client peer.
 * @param [in] mtu Value to set local mtu:
 * * This should be larger than 23 and lower or equal to BLE_ATT_MTU_MAX = 527.
 */
/* STATIC */
int Device::setMTU(uint16_t mtu) {
  NIMBLE_LOGD(LOG_TAG, ">> setLocalMTU: %d", mtu);

  int rc = ble_att_set_preferred_mtu(mtu);

  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "Could not set local mtu value to: %d", mtu);
  }

  NIMBLE_LOGD(LOG_TAG, "<< setLocalMTU");
  return rc;
}// setMTU

/**
 * @brief Get local MTU value set.
 * @return The current preferred MTU setting.
 */
/* STATIC */
uint16_t Device::getMTU() {
  return ble_att_preferred_mtu();
}

#ifdef ESP_PLATFORM
#ifdef CONFIG_BTDM_BLE_SCAN_DUPL
/**
 * @brief Set the duplicate filter cache size for filtering scanned devices.
 * @param [in] cacheSize The number of advertisements filtered before the cache is reset.\n
 * Range is 10-1000, a larger value will reduce how often the same devices are reported.
 * @details Must only be called before calling Device::init.
 */
/*STATIC*/
void Device::setScanDuplicateCacheSize(uint16_t cacheSize) {
  if (initialized) {
    NIMBLE_LOGE(LOG_TAG, "Cannot change scan cache size while initialized");
    return;
  } else if (cacheSize > 1000 || cacheSize < 10) {
    NIMBLE_LOGE(LOG_TAG, "Invalid scan cache size; min=10 max=1000");
    return;
  }

  m_scanDuplicateSize = cacheSize;
}

/**
 * @brief Set the duplicate filter mode for filtering scanned devices.
 * @param [in] mode One of three possible options:
 * * CONFIG_BTDM_SCAN_DUPL_TYPE_DEVICE (0) (default)\n
     Filter by device address only, advertisements from the same address will be reported only once.
 * * CONFIG_BTDM_SCAN_DUPL_TYPE_DATA (1)\n
     Filter by data only, advertisements with the same data will only be reported once,\n
     even from different addresses.
 * * CONFIG_BTDM_SCAN_DUPL_TYPE_DATA_DEVICE (2)\n
     Filter by address and data, advertisements from the same address will be reported only once,\n
     except if the data in the advertisement has changed, then it will be reported again.
 * @details Must only be called before calling Device::init.
 */
/*STATIC*/
void Device::setScanFilterMode(uint8_t mode) {
  if (initialized) {
    NIMBLE_LOGE(LOG_TAG, "Cannot change scan duplicate type while initialized");
    return;
  } else if (mode > 2) {
    NIMBLE_LOGE(LOG_TAG, "Invalid scan duplicate type");
    return;
  }

  m_scanFilterMode = mode;
}
#endif// CONFIG_BTDM_BLE_SCAN_DUPL
#endif// ESP_PLATFORM

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL) || defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
/**
 * @brief Gets the number of bonded peers stored
 */
/*STATIC*/
int Device::getNumBonds() {
  ble_addr_t peer_id_addrs[MYNEWT_VAL(BLE_STORE_MAX_BONDS)];
  int num_peers, rc;

  rc = ble_store_util_bonded_peers(&peer_id_addrs[0], &num_peers, MYNEWT_VAL(BLE_STORE_MAX_BONDS));
  if (rc != 0) {
    return 0;
  }

  return num_peers;
}

/**
 * @brief Deletes all bonding information.
 */
/*STATIC*/
void Device::deleteAllBonds() {
  ble_store_clear();
}

/**
 * @brief Deletes a peer bond.
 * @param [in] address The address of the peer with which to delete bond info.
 * @returns true on success.
 */
/*STATIC*/
bool Device::deleteBond(const Address &address) {
  ble_addr_t delAddr;
  memcpy(&delAddr.val, address.getNative(), 6);
  delAddr.type = address.getType();

