jadjer/esp32-nimble/src/Device.cpp
#ifdef CONFIG_ENABLE_ARDUINO_DEPENDS
    // make sure the linker includes esp32-hal-bt.c so Arduino init doesn't release BLE memory.
    btStarted();
#endif

    errRc = nvs_flash_init();

    if (errRc == ESP_ERR_NVS_NO_FREE_PAGES || errRc == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      ESP_ERROR_CHECK(nvs_flash_erase());
      errRc = nvs_flash_init();
    }

    ESP_ERROR_CHECK(errRc);

    esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT);

#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
    esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
#if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32S3)
    bt_cfg.bluetooth_mode = ESP_BT_MODE_BLE;
#else
    bt_cfg.mode = ESP_BT_MODE_BLE;
    bt_cfg.ble_max_conn = CONFIG_BT_NIMBLE_MAX_CONNECTIONS;
#endif

#ifdef CONFIG_BTDM_BLE_SCAN_DUPL
    bt_cfg.normal_adv_size = m_scanDuplicateSize;
    bt_cfg.scan_duplicate_type = m_scanFilterMode;
#endif
    ESP_ERROR_CHECK(esp_bt_controller_init(&bt_cfg));
    ESP_ERROR_CHECK(esp_bt_controller_enable(ESP_BT_MODE_BLE));
    ESP_ERROR_CHECK(esp_nimble_hci_init());
#endif
#endif
    nimble_port_init();

    // Setup callbacks for host events
    ble_hs_cfg.reset_cb = Device::onReset;
    ble_hs_cfg.sync_cb = Device::onSync;

    // Set initial security capabilities
    ble_hs_cfg.sm_io_cap = BLE_HS_IO_NO_INPUT_OUTPUT;
    ble_hs_cfg.sm_bonding = 0;
    ble_hs_cfg.sm_mitm = 0;
    ble_hs_cfg.sm_sc = 1;
    ble_hs_cfg.sm_our_key_dist = 1;
    ble_hs_cfg.sm_their_key_dist = 3;

    ble_hs_cfg.store_status_cb = ble_store_util_status_rr; /*TODO: Implement handler for this*/

    // Set the device name.
    rc = ble_svc_gap_device_name_set(deviceName.c_str());
    assert(rc == 0);

    ble_store_config_init();

    nimble_port_freertos_init(Device::host_task);
  }

  // Wait for host and controller to sync before returning and accepting new tasks
  while (!m_synced) {
    taskYIELD();
  }

  initialized = true;// Set the initialization flag to ensure we are only initialized once.
}// init

/**
 * @brief Shutdown the NimBLE stack/controller.
 * @param [in] clearAll If true, deletes all server/advertising/scan/client objects after deinitializing.
 * @note If clearAll is true when called, any references to the created objects become invalid.
 */
/* STATIC */
void Device::deinit(bool clearAll) {
  int ret = nimble_port_stop();
  if (ret == 0) {
    nimble_port_deinit();
#ifdef ESP_PLATFORM
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
    ret = esp_nimble_hci_and_controller_deinit();
    if (ret != ESP_OK) {
      NIMBLE_LOGE(LOG_TAG, "esp_nimble_hci_and_controller_deinit() failed with error: %d", ret);
    }
#endif
#endif
    initialized = false;
    m_synced = false;

    if (clearAll) {
#if defined(CONFIG_BT_NIMBLE_ROLE_PERIPHERAL)
      if (Device::m_pServer != nullptr) {
        delete Device::m_pServer;
        Device::m_pServer = nullptr;
      }
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_BROADCASTER)
      if (Device::m_bleAdvertising != nullptr) {
        delete Device::m_bleAdvertising;
        Device::m_bleAdvertising = nullptr;
      }
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
      if (Device::m_pScan != nullptr) {
        delete Device::m_pScan;
        Device::m_pScan = nullptr;
      }
#endif

#if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
      for (auto &it : m_cList) {
        deleteClient(it);
        m_cList.clear();
      }
#endif

      m_ignoreList.clear();
    }
  }
}// deinit

/**
 * @brief Set the BLEDevice's name
 * @param [in] deviceName The device name of the device.
 */
/* STATIC */
void Device::setDeviceName(const std::string &deviceName) {
  ble_svc_gap_device_name_set(deviceName.c_str());
}// setDeviceName

/**
 * @brief Check if the initialization is complete.
 * @return true if initialized.
 */
/*STATIC*/
bool Device::getInitialized() {
  return initialized;
}// getInitialized

/**
 * @brief Set the authorization mode for this device.
 * @param bonding If true we allow bonding, false no bonding will be performed.
 * @param mitm If true we are capable of man in the middle protection, false if not.
 * @param sc If true we will perform secure connection pairing, false we will use legacy pairing.
 */
/*STATIC*/
void Device::setSecurityAuth(bool bonding, bool mitm, bool sc) {
  NIMBLE_LOGD(LOG_TAG, "Setting bonding: %d, mitm: %d, sc: %d", bonding, mitm, sc);
  ble_hs_cfg.sm_bonding = bonding;
  ble_hs_cfg.sm_mitm = mitm;
  ble_hs_cfg.sm_sc = sc;
}// setSecurityAuth

/**
 * @brief Set the authorization mode for this device.
 * @param auth_req A bitmap indicating what modes are supported.\n
 * The available bits are defined as:
 * * 0x01 BLE_SM_PAIR_AUTHREQ_BOND
 * * 0x04 BLE_SM_PAIR_AUTHREQ_MITM
 * * 0x08 BLE_SM_PAIR_AUTHREQ_SC
 * * 0x10 BLE_SM_PAIR_AUTHREQ_KEYPRESS  - not yet supported.
 */
/*STATIC*/
void Device::setSecurityAuth(uint8_t auth_req) {
  Device::setSecurityAuth((auth_req & BLE_SM_PAIR_AUTHREQ_BOND) > 0,
                                (auth_req & BLE_SM_PAIR_AUTHREQ_MITM) > 0,
                                (auth_req & BLE_SM_PAIR_AUTHREQ_SC) > 0);
}// setSecurityAuth

/**
 * @brief Set the Input/Output capabilities of this device.
 * @param iocap One of the following values:
 * * 0x00 BLE_HS_IO_DISPLAY_ONLY         DisplayOnly IO capability
 * * 0x01 BLE_HS_IO_DISPLAY_YESNO        DisplayYesNo IO capability
 * * 0x02 BLE_HS_IO_KEYBOARD_ONLY        KeyboardOnly IO capability
 * * 0x03 BLE_HS_IO_NO_INPUT_OUTPUT      NoInputNoOutput IO capability
 * * 0x04 BLE_HS_IO_KEYBOARD_DISPLAY     KeyboardDisplay Only IO capability
 */
/*STATIC*/
void Device::setSecurityIOCap(uint8_t iocap) {
  ble_hs_cfg.sm_io_cap = iocap;
}// setSecurityIOCap

/**
 * @brief If we are the initiator of the security procedure this sets the keys we will distribute.
 * @param init_key A bitmap indicating which keys to distribute during pairing.\n
 * The available bits are defined as:
 * * 0x01: BLE_SM_PAIR_KEY_DIST_ENC  - Distribute the encryption key.
 * * 0x02: BLE_SM_PAIR_KEY_DIST_ID   - Distribute the ID key (IRK).
 * * 0x04: BLE_SM_PAIR_KEY_DIST_SIGN
 * * 0x08: BLE_SM_PAIR_KEY_DIST_LINK
 */
/*STATIC*/
void Device::setSecurityInitKey(uint8_t init_key) {
  ble_hs_cfg.sm_our_key_dist = init_key;
}// setsSecurityInitKey

/**
 * @brief Set the keys we are willing to accept during pairing.
 * @param resp_key A bitmap indicating which keys to accept during pairing.
 * The available bits are defined as:
 * * 0x01: BLE_SM_PAIR_KEY_DIST_ENC  -  Accept the encryption key.
 * * 0x02: BLE_SM_PAIR_KEY_DIST_ID   -  Accept the ID key (IRK).
 * * 0x04: BLE_SM_PAIR_KEY_DIST_SIGN
 * * 0x08: BLE_SM_PAIR_KEY_DIST_LINK
 */
/*STATIC*/
void Device::setSecurityRespKey(uint8_t resp_key) {
  ble_hs_cfg.sm_their_key_dist = resp_key;
}// setsSecurityRespKey

/**
 * @brief Set the passkey the server will ask for when pairing.
 * @param [in] pin The passkey to use.
 */
/*STATIC*/
void Device::setSecurityPasskey(uint32_t pin) {
  m_passkey = pin;
}// setSecurityPasskey

/**
 * @brief Get the current passkey used for pairing.
 * @return The current passkey.
 */
/*STATIC*/
uint32_t Device::getSecurityPasskey() {
  return m_passkey;
}// getSecurityPasskey

#ifdef ESP_PLATFORM
/**
 * @brief Set the own address type.
 * @param [in] own_addr_type Own Bluetooth Device address type.\n
 * The available bits are defined as:
 * * 0x00: BLE_OWN_ADDR_PUBLIC
 * * 0x01: BLE_OWN_ADDR_RANDOM
 * * 0x02: BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT
 * * 0x03: BLE_OWN_ADDR_RPA_RANDOM_DEFAULT
 * @param [in] useNRPA If true, and address type is random, uses a non-resolvable random address.
 */
/*STATIC*/
void Device::setOwnAddrType(uint8_t own_addr_type, bool useNRPA) {
  m_own_addr_type = own_addr_type;
  switch (own_addr_type) {
#ifdef CONFIG_IDF_TARGET_ESP32
  case BLE_OWN_ADDR_PUBLIC:
    ble_hs_pvcy_rpa_config(NIMBLE_HOST_DISABLE_PRIVACY);
    break;
#endif
  case BLE_OWN_ADDR_RANDOM:
    setSecurityInitKey(BLE_SM_PAIR_KEY_DIST_ENC | BLE_SM_PAIR_KEY_DIST_ID);
#ifdef CONFIG_IDF_TARGET_ESP32
    ble_hs_pvcy_rpa_config(useNRPA ? NIMBLE_HOST_ENABLE_NRPA : NIMBLE_HOST_ENABLE_RPA);
#endif
    break;
  case BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT:
  case BLE_OWN_ADDR_RPA_RANDOM_DEFAULT:
    setSecurityInitKey(BLE_SM_PAIR_KEY_DIST_ENC | BLE_SM_PAIR_KEY_DIST_ID);
#ifdef CONFIG_IDF_TARGET_ESP32
    ble_hs_pvcy_rpa_config(NIMBLE_HOST_ENABLE_RPA);
#endif
    break;
  }
}// setOwnAddrType
#endif

/**
 * @brief Start the connection securing and authorization for this connection.
 * @param conn_id The connection id of the peer device.
 * @returns NimBLE stack return code, 0 = success.
 */
/* STATIC */
int Device::startSecurity(uint16_t conn_id) {
  int rc = ble_gap_security_initiate(conn_id);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "ble_gap_security_initiate: rc=%d %s", rc, Utils::returnCodeToString(rc));
  }

  return rc;
}// startSecurity

/**
 * @brief Check if the device address is on our ignore list.
 * @param [in] address The address to look for.
 * @return True if ignoring.
 */
/*STATIC*/
bool Device::isIgnored(const Address &address) {
  for (auto &it : m_ignoreList) {
    if (it.equals(address)) {
      return true;
    }
  }

  return false;
}

/**
 * @brief Add a device to the ignore list.
 * @param [in] address The address of the device we want to ignore.
 */
/*STATIC*/
void Device::addIgnored(const Address &address) {
  m_ignoreList.push_back(address);
}

/**
 * @brief Remove a device from the ignore list.
 * @param [in] address The address of the device we want to remove from the list.
 */
/*STATIC*/
void Device::removeIgnored(const Address &address) {
  for (auto it = m_ignoreList.begin(); it != m_ignoreList.end(); ++it) {
    if ((*it).equals(address)) {
      m_ignoreList.erase(it);
      return;
    }
  }
}

/**
 * @brief Set a custom callback for gap events.
 * @param [in] handler The function to call when gap events occur.
 */
/*STATIC*/
void Device::setCustomGapHandler(gap_event_handler handler) {
  m_customGapHandler = handler;
  auto returnCode = ble_gap_event_listener_register(&m_listener, m_customGapHandler, nullptr);
  if (returnCode == BLE_HS_EALREADY) {
    NIMBLE_LOGI(LOG_TAG, "Already listening to GAP events.");
  } else {
    assert(returnCode == 0);
  }
}// setCustomGapHandler

}

#endif// CONFIG_BT_ENABLED
